sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
/*
 * The tasks as described in the comments at the top of this file.
 */
static void prvQueueReceiveTask( void *pvParameters );
static void prvClockTask( void *pvParameters );
static void prvCanTask( void *pvParameters );

/*-----------------------------------------------------------*/

/* The queue used by both tasks. */
static QueueHandle_t xQueue = NULL;
static QueueHandle_t xCanQueue = NULL;

struct AppMessage ADCResult = {0};
struct AppMessage CANflag = {0};

uint32_t rid;
uint32_t ridbuf[4];
uint8_t nirq = 0;
uint8_t mext;
uint8_t eflag;
uint8_t irq, buf[8];
uint16_t ADCdata[16];
uint32_t ADCtime;
uint8_t wakecount = 0;
uint8_t errorcount = 0;
#pragma NOINIT(bootCount)
uint16_t bootCount;
#pragma NOINIT(bootCause)
uint16_t bootCause;
uint32_t uptime= 0;
uint32_t wd_timeout = 86400;
#pragma NOINIT(wd_count)
uint16_t wd_count;
uint16_t rx_csp = 0;
uint16_t tx_csp = 0;


#define DEFAULT_TLM_PERIOD (30)

uint32_t tlm_period = DEFAULT_TLM_PERIOD;
uint32_t tlm_duration = 0;
uint32_t tlm_counter = 0;

volatile uint32_t wdt1_pulse_period_s = WDT_PULSE_PERIOD_DEFAULT_S;
volatile uint32_t wdt2_pulse_period_s = WDT_PULSE_PERIOD_DEFAULT_S;

/* Fault-inject diagnostics: snapshot of WDT2 pin registers captured each
 * tick while the fault is active.  Inspect these in the CCS Expressions
 * view to determine whether P3SEL, P3DIR, or P3OUT is being changed by
 * something between ticks.  All fields should be stable once the fault fires:
 *   p3sel0_snap & BIT4  == 0  (GPIO mode, not peripheral)
 *   p3sel1_snap & BIT4  == 0
 *   p3dir_snap  & BIT4  != 0  (output)
 *   p3out_snap  & BIT4  == 0  (stuck low)
 * A non-zero SEL bit means a peripheral reclaimed the pin between ticks.
 * A high OUT bit with zero SEL bits means something wrote P3OUT |= BIT4. */
volatile uint8_t dbg_p3sel0_snap = 0U;
volatile uint8_t dbg_p3sel1_snap = 0U;
volatile uint8_t dbg_p3dir_snap  = 0U;
volatile uint8_t dbg_p3out_snap  = 0U;
volatile uint32_t dbg_fault_tick = 0U;

csp_iface_t * default_interface = NULL;
csp_conn_t *conn = NULL;

uint8_t tlm_pkt[MAX_TLM_PACKET_SIZE] = {0,};

#pragma NOINIT(current_second)
uint32_t current_second;

/* This is the hardware-specific reboot function that is registered with the CSP library, and called on csp_reboot(). */
int csp_reboot_function(void)
{
    /* trigger a brown-out reset, this is equivalent to a initial power-up reset, and completely resets the MSP430.  */
    PMM_trigBOR();

    /* shouldn't get here */
    return CSP_ERR_NONE;
}

/* Keep the low pulse tightly bounded by avoiding scheduler/ISR preemption. */
static inline void prvPulseWdt1(void)
{
    taskENTER_CRITICAL();
    P2OUT &= (uint8_t) ~BIT2;
    __delay_cycles( WDT_EDGE_LOW_CYCLES );
    P2OUT |= BIT2;
    taskEXIT_CRITICAL();
}

/* Keep the low pulse tightly bounded by avoiding scheduler/ISR preemption. */
static inline void prvPulseWdt2(void)
{
    taskENTER_CRITICAL();
    P3OUT &= (uint8_t) ~BIT4;
    __delay_cycles( WDT_EDGE_LOW_CYCLES );
    P3OUT |= BIT4;
    taskEXIT_CRITICAL();
}

static inline void prvForceWdtLine(uint8_t line, uint8_t level_high)
{
    taskENTER_CRITICAL();

    if (line == 1U)
    {
        /* Ensure pin is GPIO output, not a peripheral function. */
        P2SEL0 &= (uint8_t) ~BIT2;
        P2SEL1 &= (uint8_t) ~BIT2;
        P2DIR  |= BIT2;
        if (level_high != 0U)
        {
            P2OUT |= BIT2;
        }
        else
        {
            P2OUT &= (uint8_t) ~BIT2;
        }
    }
    else if (line == 2U)
    {
        /* Ensure pin is GPIO output, not a peripheral function. */
        P3SEL0 &= (uint8_t) ~BIT4;
        P3SEL1 &= (uint8_t) ~BIT4;
        P3DIR  |= BIT4;
        if (level_high != 0U)
        {
            P3OUT |= BIT4;
        }
        else
        {
            P3OUT &= (uint8_t) ~BIT4;
        }
    }

    taskEXIT_CRITICAL();
}


void main_blinky( void )
{
    int error;

    bootCause = SYSRSTIV;

    if (bootCause <= SYSRSTIV_DOBOR)
    {
        /* power on reset, NMI(JTAG) reset or commanded (do BOR) reset - clear wd_count */
        wd_count = 0;

        if (bootCause <= SYSRSTIV_RSTNMI)
        {
            /* reset time */
            current_second = 0;
        }
    }

    ++bootCount;

    csp_sys_set_reboot(csp_reboot_function);

    error = csp_can_socketcan_open_and_add_interface("/dev/can", CSP_IF_CAN_DEFAULT_NAME, 0, false, &default_interface);
    if(error != CSP_ERR_NONE) {
        /* complain! */
        //csp_print("Error %d opening CAN interface", error);
    }

    csp_rtable_set(0, 0, default_interface, CSP_NO_VIA_ADDRESS);

	/* Create the queue. */
    xQueue = xQueueCreate( mainQUEUE_LENGTH, sizeof( struct AppMessage ) );
    xCanQueue = xQueueCreate( 8, sizeof( struct AppMessage ) );

	if( xQueue != NULL )
	{
        /* Start the tasks. */
	    csp_route_start_task(configMINIMAL_STACK_SIZE, mainQUEUE_RECEIVE_TASK_PRIORITY+1);

		xTaskCreate( prvQueueReceiveTask,				/* The function that implements the task. */
					"Rx", 								/* The text name assigned to the task - for debug only as it is not used by the kernel. */
					configMINIMAL_STACK_SIZE, 			/* The size of the stack to allocate to the task. */
					NULL, 								/* The parameter passed to the task - not used in this case. */
					mainQUEUE_RECEIVE_TASK_PRIORITY, 	/* The priority assigned to the task. */
					NULL );								/* The task handle is not required, so NULL is passed. */

		xTaskCreate( prvClockTask, "CLK", configMINIMAL_STACK_SIZE, NULL, mainQUEUE_RECEIVE_TASK_PRIORITY+1, NULL );

        xTaskCreate( prvCanTask, "CN", configMINIMAL_STACK_SIZE, NULL, mainQUEUE_RECEIVE_TASK_PRIORITY+2, NULL ); // highest priority

		/* Start the tasks and timer running. */
		vTaskStartScheduler();
	}

	/* If all is well, the scheduler will now be running, and the following
	line will never be reached.  If the following line does execute, then
	there was insufficient FreeRTOS heap memory available for the Idle and/or
	timer tasks to be created.  See the memory management section on the
	FreeRTOS web site for more details on the FreeRTOS heap
	http://www.freertos.org/a00111.html. */
	for( ;; );
}
/*-----------------------------------------------------------*/

