sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
static void prvClockTask( void *pvParameters )
{
TickType_t xNextWakeTime;
struct AppMessage msg;

	/* Remove compiler warning about unused parameter. */
	( void ) pvParameters;

	/* Initialise xNextWakeTime - this only needs to be done once. */
	xNextWakeTime = xTaskGetTickCount();

	for( ;; )
	{
		/* Place this task in the blocked state until it is time to run again. */
		vTaskDelayUntil( &xNextWakeTime, mainQUEUE_SEND_FREQUENCY_MS );

		++current_second;

		/* Send to the queue - causing the queue receive task to unblock and
		toggle the LED.  0 is used as the block time so the sending operation
		will not block - it shouldn't need to block as the queue should always
		be empty at this point in the code. */
		msg.msgID = eTimer;
		msg.pvData = 0;
		xQueueSend( xQueue, &msg, 0U );

        if(--wd_timeout <= 0)
        {
            /* trigger ground watchdog reboot */
           ++wd_count;
           PMM_trigPOR();
        }
  	}
}
/*-----------------------------------------------------------*/

static void prvQueueReceiveTask( void *pvParameters )
{
    struct AppMessage msg;
    csp_packet_t * packet;
    csp_socket_t *sock = csp_socket(CSP_SO_NONE);
    csp_conn_t *conn;
    uint32_t wdt1_counter = 0;
    uint32_t wdt2_counter = 0;
    uint32_t wdt_fault_blink_counter = 0;
    uint8_t wdt_fault_active = 0U;

    /* Remove compiler warning about unused parameter. */
    ( void ) pvParameters;

    /* Bind socket to all ports, e.g. all incoming connections will be handled here */
    csp_bind(sock, CSP_ANY);

    /* Create a backlog of 10 connections, i.e. up to 10 new connections can be queued */
    csp_listen(sock, 10);

    for( ;; )
    {
        /* Wait until something arrives in the queue - this task will block
        indefinitely provided INCLUDE_vTaskSuspend is set to 1 in
        FreeRTOSConfig.h. */
        xQueueReceive( xQueue, &msg, portMAX_DELAY );

        /*  To get here something must have been received from the queue, but
        is it the expected value?  If it is, toggle the LED. */
        if( msg.msgID == eTimer )
        {
            if((tlm_period > 0) && (++tlm_counter >= tlm_period))
            {
                tlm_counter = 0;
                ADCtime = current_second;
                /* Enable and Start Single Conversion Mode for channel 0: */
                ADC12_B_startConversion(ADC12_B_BASE, ADC12_B_START_AT_ADC12MEM0, ADC12_B_SEQOFCHANNELS);
            }

            if(tlm_duration > 0)
            {
                /* countdown timer to revert to default tlm period */
                if(--tlm_duration == 0)
                {
                    /* timer expired */
                    tlm_period = DEFAULT_TLM_PERIOD;
                }
            }
            vParTestToggleLED( mainTASK_LED );
            vParTestToggleLED( mainTASK_LED_2 );

#if (WDT_FAULT_INJECT_ENABLE != 0U)
            /* Activate fault after N blinks. */
            if ((wdt_fault_active == 0U) && (++wdt_fault_blink_counter >= WDT_FAULT_AFTER_BLINKS))
            {
                wdt_fault_active = 1U;
                if (WDT_FAULT_LINE == 1U)
                {
                    wdt1_pulse_period_s = 0U;
                }
                else if (WDT_FAULT_LINE == 2U)
                {
                    wdt2_pulse_period_s = 0U;
                }
            }
#endif

            /* Toggle each WDT output on its own configurable cadence. */
            if (wdt1_pulse_period_s == 0U)
            {
                wdt1_counter = 0;
            }
            else if (++wdt1_counter >= wdt1_pulse_period_s)
            {
                wdt1_counter = 0;
                prvPulseWdt1();
            }

            if (wdt2_pulse_period_s == 0U)
            {
                wdt2_counter = 0;
            }
            else if (++wdt2_counter >= wdt2_pulse_period_s)
            {
                wdt2_counter = 0;
                prvPulseWdt2();
            }

#if (WDT_FAULT_INJECT_ENABLE != 0U)
            /* Re-assert the stuck level every tick while fault is active.
             * This runs after the pulse logic so it is always the last write
             * to the pin, overriding any peripheral or ISR that drove it back. */
            if (wdt_fault_active == 1U)
            {
                /* Snapshot registers BEFORE re-asserting so the values reflect
                 * what arrived between ticks.  Check these in the debugger:
                 *   dbg_p3sel0_snap & BIT4 or dbg_p3sel1_snap & BIT4 non-zero
                 *     → a peripheral reclaimed P3.4 between ticks.
                 *   dbg_p3out_snap & BIT4 non-zero, both SEL snaps zero
                 *     → something wrote P3OUT |= BIT4 directly. */
                dbg_p3sel0_snap = P3SEL0;
                dbg_p3sel1_snap = P3SEL1;
                dbg_p3dir_snap  = P3DIR;
                dbg_p3out_snap  = P3OUT;
                ++dbg_fault_tick;

                prvForceWdtLine(WDT_FAULT_LINE, WDT_FAULT_LEVEL_HIGH);
            }
#endif
        }

        if( msg.msgID == eADC )
        {
            packet = csp_buffer_get(0);

            if(packet != NULL ) {
                /* copy ADCtime, followed by ADCdata */
                packet->data[0] = eAPP_TLM;
                packet->data[1] = 0; //OK
                packet->data[2] = MISSION_ID_0;
                packet->data[3] = MISSION_ID_1;
                packet->data[4] = 0;
                packet->data[5] = CSP_ID;
                memcpy(&(packet->data[6]), &ADCtime, 4);
                memcpy(&(packet->data[10]),ADCdata, 22);
                packet->length = 32;

                if((conn = csp_connect(CSP_PRIO_NORM, PC_CSP_ID, PC_BUFF_PORT, 0, CSP_SO_NONE)) != NULL) {
                    // send to PC, 3000ms timeout
                    if( csp_send(conn, packet, 3000) != CSP_ERR_NONE) {
                        csp_buffer_free(packet);
                    }
                    can_start_tx();
                    csp_close(conn);
                }
            }
        }

        /* Test for a new connection, 0 mS timeout */
        if ((conn = csp_accept(sock, 0)) != NULL) {
            /* handle connection */
            packet = csp_read(conn, 0);
            if (packet != NULL) {

                /* handle the CSP packet */
                ++rx_csp;

                switch(packet->id.dport){
                case CSP_TLM:
                    // CSP tlm request
                    handle_csp_tlm_request(conn,packet);
                    break;

                case CSP_TSYNC:
                    handle_csp_timesync(conn,packet);
                    break;

                default:
                    csp_service_handler(conn, packet);
                    break;
                }
                can_start_tx();
            }
            csp_close(conn);
        }
    }
}

static void prvCanTask( void *pvParameters )
{
    struct AppMessage msg;

    /* Remove compiler warning about unused parameter. */
    ( void ) pvParameters;

    for( ;; )
    {
        /* Wait until something arrives in the queue - this task will block
        indefinitely provided INCLUDE_vTaskSuspend is set to 1 in
        FreeRTOSConfig.h. */
        xQueueReceive( xCanQueue, &msg, portMAX_DELAY /* pdMS_TO_TICKS( 100 )*/ );

        if (mcp2515_irq & MCP2515_IRQ_FLAGGED) {
            int i;
            //irq = can_irq_handler();
            while( (irq = can_irq_handler()) != 0) {
                if (irq & MCP2515_IRQ_RX && !(irq & MCP2515_IRQ_ERROR)) {
                    i = can_recv(&rid, &mext, buf);
                    if (i >= 0) {
                        if (mext) {

                            ridbuf[nirq++] = rid;
                            if(nirq>=4) {
                            nirq=0;
                            }

                            /* TODO: replace the following with CSP CAN packet handling when we have room */
                            /* Call RX callback */
                            //csp_can_rx(&ctx->iface, frame.can_id, frame.data, frame.can_dlc, NULL);
                            csp_can_rx(default_interface, rid, buf, i, NULL);
                        }
                    }
                } else if (irq & MCP2515_IRQ_TX && !(irq & MCP2515_IRQ_ERROR) ) {
                    /* successful transmit complete */
                    can_tx_next_packet(NULL);
                } else if (irq & MCP2515_IRQ_ERROR) {
                    can_r_reg(MCP2515_CANINTF, &mext, 1);
                    can_r_reg(MCP2515_EFLG, &eflag, 1);
                    // TODO  -assert? - reset? - handle error?
                }
            }
        }
        can_tx_next_packet(NULL);
    }
}

