sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
void can_start_tx(void)
{
    // TODO - replace with FreeRTOS task notification (plus task_woken)?
    xQueueSend( xCanQueue, &CANflag, 0U );
}


/**********************************************************************//**
 * @brief  ADC12 ISR
 *
 * @param  none
 *
 * @return none
 *************************************************************************/
#pragma vector=ADC12_VECTOR
__interrupt void ADC12_ISR(void)
{
    uint8_t channel = 0;

  switch(__even_in_range(ADC12IV,12))
  {
    case ADC12IV_NONE: break;               // No interrupt
    case ADC12IV_ADC12OVIFG: break;         // conversion result overflow
    case ADC12IV_ADC12TOVIFG: break;        // conversion time overflow
    case ADC12IV_ADC12HIIFG: break;         // ADC12HI
    case ADC12IV_ADC12LOIFG: break;         // ADC12LO
    case ADC12IV_ADC12INIFG: break;         // ADC12IN
    //case ADC12IV_ADC12IFG0:
    case ADC12IV_ADC12IFG10:
        for(channel = 0; channel < 11; channel++)
        {
            /* 2*channel as reading 16-bit value with 8-bit offset */
            ADCdata[channel] = ADC12_B_getResults(ADC12_B_BASE, 2*channel);
        }
        ADCResult.msgID = eADC;
        /* now post result to xQueue */
        xQueueSendFromISR( xQueue, &ADCResult, 0U );
        __bic_SR_register_on_exit(CPUOFF);  //required?
        break;
    default: break;
  }
}


// ISR for PORT2
#pragma vector=PORT2_VECTOR
__interrupt void P2_ISR(void)
{
    //BaseType_t task_woken = 0;

    if (P2IFG & CAN_IRQ_PORTBIT) {
        P2IFG &= ~CAN_IRQ_PORTBIT;
        mcp2515_irq |= MCP2515_IRQ_FLAGGED;

        xQueueSendFromISR( xCanQueue, &CANflag, 0U );

        //__bic_SR_register_on_exit(LPM3_bits);
        __bic_SR_register_on_exit(CPUOFF);
    }
}


void handle_csp_tlm_request(csp_conn_t * conn, csp_packet_t * packet) {
    eTlmType packet_type = (eTlmType)packet->data[0];
    uint32_t tick = current_second;
    uint32_t scratch;

    switch(packet_type) {
    case eSOH_TLM:
        uptime = csp_get_uptime_s();
        tx_csp = (uint16_t)default_interface->tx;
        packet->data[0] = (uint8_t)packet_type;
        packet->data[1] = 0; //OK
        packet->data[2] = MISSION_ID_0;
        packet->data[3] = MISSION_ID_1;
        packet->data[4] = 0;
        packet->data[5] = CSP_ID;
        memcpy(&(packet->data[6]), &tick, sizeof(tick));
        memcpy(&(packet->data[10]),&bootCount, sizeof(bootCount));
        memcpy(&(packet->data[12]),&bootCause, sizeof(bootCause));
        memcpy(&(packet->data[14]),&uptime, sizeof(uptime));
        memcpy(&(packet->data[18]),&wd_timeout, sizeof(wd_timeout));
        memcpy(&(packet->data[22]),&wd_count, sizeof(wd_count));
        memcpy(&(packet->data[24]),&rx_csp, sizeof(rx_csp));
        memcpy(&(packet->data[26]),&tx_csp, sizeof(tx_csp));
        packet->length = 28;
        if (!csp_send(conn, packet, 0))
            csp_buffer_free(packet);
        break;

    case eAPP_TLM:
        // send application telemetry
        //memset();
        //bzero(tlm_pkt,MAX_TLM_PACKET_SIZE);
        packet->data[0] = (uint8_t)packet_type;
        packet->data[1] = 0; //OK
        packet->data[2] = MISSION_ID_0;
        packet->data[3] = MISSION_ID_1;
        packet->data[4] = 0;
        packet->data[5] = CSP_ID;
        memcpy(&(packet->data[6]), &ADCtime, 4);
        memcpy(&(packet->data[10]),ADCdata, 22);
        packet->length = 32;
        if (!csp_send(conn, packet, 0))
            csp_buffer_free(packet);
        break;

    case eVER_TLM:
        // send application version telemetry
        packet->data[0] = (uint8_t)packet_type;
        packet->data[1] = 0; //OK
        packet->data[2] = MISSION_ID_0;
        packet->data[3] = MISSION_ID_1;
        packet->data[4] = 0;
        packet->data[5] = CSP_ID;
        packet->data[6] = VER_MAJOR;
        packet->data[7] = VER_MINOR;
        packet->data[8] = VER_PATCH;
        packet->length = 9;
        if (!csp_send(conn, packet, 0))
            csp_buffer_free(packet);
        break;

    case eSET_RATE_TLM:
        // set application telemetry rate
        packet->data[0] = (uint8_t)packet_type;
        packet->length = 2;

        memcpy(&scratch,&(packet->data[1]),4);
        tlm_period = scratch;
        memcpy(&scratch,&(packet->data[5]),4);
        tlm_duration = scratch;
        packet->data[1] = 0; /* status = OK */

        if (!csp_send(conn, packet, 0))
             csp_buffer_free(packet);
        break;

    default:
        // unhandled tlm type - free packet.
        csp_buffer_free(packet);
        break;
    }

}

void handle_csp_timesync(csp_conn_t * conn, csp_packet_t * packet)
{
    switch(packet->data[0]) {

        case 0: {
            /* request time */
            int32_t now;
            //csp_timestamp_t ts;
            packet->data[1] = 0;
            //csp_clock_get_time(&ts);
            //now = htole32(ts.tv_sec);
            //now = csp_hton32(current_second);
            now = current_second;

            memcpy(&packet->data[2],&now, sizeof(int32_t));
            packet->length = 6;  /* cmd id + error code + time */
            if (!csp_send(conn, packet, 0))
                csp_buffer_free(packet);
        }
        break;

        case 1: {   /* set time */
            int32_t now;
            //csp_timestamp_t ts;
            memcpy(&now, &packet->data[1], sizeof(int32_t));
            //now = csp_ntoh32(now);
            current_second = now;
            //ts.tv_sec = le32toh(now);
            //ts.tv_nsec = 0;
            packet->data[1] = 0; //csp_clock_set_time(&ts);
            packet->length = 2;
            if (!csp_send(conn, packet, 0))
                csp_buffer_free(packet);
        }
        break;

        case 2:     /* Last PPS time */
        case 3:     /* Get precise time */
        case 4:     /* Sync time request */
            csp_buffer_free(packet);
        break;

        default:
            csp_buffer_free(packet);
        break;
    }
}




